> > adding `.${var.domain}` to every record avoids most of the issues
> 
> this is expected behaviour and has been the case for all 5.x releases. 5.2.0 introduced stricter checking of the plan stage for resource attributes matching their API value which is why this may have appeared to only be an issue in 5.2.0.

still this does not solve the issue with data Field for SRV records.

here is an example:
```
---
resource "cloudflare_dns_record" "caldavs_srv" {
  zone_id  = var.zone_id
  name     = "_caldavs._tcp.${var.domain_name}"
  type     = "SRV"
  ttl      = 3600
  priority = 0

  data = {
    priority = 0
    weight   = 1
    port     = 443
    target   = var.mail_server_fqdn
  }
}
---
> terraform state show module.mail.cloudflare_dns_record.caldavs_srv
# module.mail.cloudflare_dns_record.caldavs_srv:
resource "cloudflare_dns_record" "caldavs_srv" {
    content     = "1 443 mail.<DOMAIN2>.com"
    created_on  = "2025-03-25T15:19:49Z"
    data        = {
        lat_minutes    = 0
        lat_seconds    = 0
        long_minutes   = 0
        long_seconds   = 0
        port           = 443
        precision_horz = 0
        precision_vert = 0
        priority       = 0
        size           = 0
        target         = "mail.<DOMAIN2>.com"
        weight         = 1
    }
    id          = "<RESOURCE_ID>"
    meta        = jsonencode({})
    modified_on = "2025-03-25T15:19:49Z"
    name        = "_caldavs._tcp.<DOMAIN>.com"
    priority    = 0
    proxiable   = false
    proxied     = false
    settings    = {}
    tags        = []
    ttl         = 3600
    type        = "SRV"
    zone_id     = "<ZONE_ID>"
}
---
> curl -X GET "https://api.cloudflare.com/client/v4/zones/<ZONE_ID>/dns_records/<RESOURCE_ID>" \
  -H "Authorization: Bearer <TOKEN>" \
  -H "Content-Type: application/json" | jq
{
  "result": {
    "id": "<RESOURCE_ID>",
    "name": "_caldavs._tcp.<DOMAIN>.com",
    "type": "SRV",
    "content": "1 443 mail.<DOMAIN2>.com",
    "priority": 0,
    "proxiable": false,
    "proxied": false,
    "ttl": 3600,
    "data": {
      "port": 443,
      "priority": 0,
      "target": "mail.<DOMAIN2>.com",
      "weight": 1
    },
    "settings": {},
    "meta": {},
    "comment": null,
    "tags": [],
    "created_on": "2025-03-25T15:19:49.394896Z",
    "modified_on": "2025-03-25T15:19:49.394896Z"
  },
  "success": true,
  "errors": [],
  "messages": []
}
---
> terraform plan
Terraform will perform the following actions:

  # module.mail.cloudflare_dns_record.caldavs_srv will be updated in-place
  ~ resource "cloudflare_dns_record" "caldavs_srv" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "1 443 mail.<DOMAIN2>.com" -> (known after apply)
      ~ created_on          = "2025-03-25T15:19:49Z" -> (known after apply)
      ~ data                = {
          + lat_minutes    = 0
          + lat_seconds    = 0
          + long_minutes   = 0
          + long_seconds   = 0
          + precision_horz = 0
          + precision_vert = 0
          + size           = 0
            # (4 unchanged attributes hidden)
        }
        id                  = "<RESOURCE_ID>"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-03-25T15:19:49Z" -> (known after apply)
        name                = "_caldavs._tcp.<DOMAIN>.com"
      ~ proxiable           = false -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }
---
> terraform apply -refresh-only
Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # module.mail.cloudflare_dns_record.caldavs_srv has changed
  ~ resource "cloudflare_dns_record" "caldavs_srv" {
      ~ data        = {
          - lat_minutes    = 0 -> null
          - lat_seconds    = 0 -> null
          - long_minutes   = 0 -> null
          - long_seconds   = 0 -> null
          - precision_horz = 0 -> null
          - precision_vert = 0 -> null
          - size           = 0 -> null
            # (4 unchanged attributes hidden)
        }
        id          = "<RESOURCE_ID>"
        name        = "_caldavs._tcp.<DOMAIN>.com"
        tags        = []
        # (11 unchanged attributes hidden)
    }
```




